ID=input('请输入18位身份证号码：');
if len(ID)==18:
    print('您输入的身份证号码是：'+ID);
else:
    print('你输入的身份证号码错误，请重新输入：');
    ID=input('请输入18位身份证号码：');

ID_add=ID[0:2]     #省份，截出前两位 2个数
ID_birth=ID[6:14]  #8个数
ID_sex=ID[16:17]#1个数

#print(ID_add,ID_birth,ID_sex)
pro={'11':'北京','12':'天津','13':'河北','14':'山西','15':'内蒙',
     '21':'辽宁','22':'吉林','23':'黑龙江','31':'上海','32':'江苏',
     '33':'浙江','34':'安徽','35':'福建','36':'江西','37':'山东',
     '41':'河北','42':'湖北','43':'湖南','44':'广东','45':'广西',
     '46':'海南','50':'重庆','51':'四川','52':'贵州','53':'云南',
     '54':'西藏','61':'陕西','62':'甘肃','63':'青海','64':'宁夏',
     '65':'新疆','71':'台湾','81':'香港'
    }
year=ID_birth[0:4]
moon=ID_birth[4:6]
day=ID_birth[6:8]
print("生日: "+year+'年'+moon+'月'+day+'日')
 
if int(ID_sex)%2==0:
  print('性别：女')
else:
  print('性别：男')



def getpro(key):  #读取省份函数
    key_list=list(pro.keys())
    if key in key_list:
        print('您所在的省份为：',pro[key])
    else:
        print('未查到对应的省份，请核实身份证号码是否正确！')
    
getpro(ID_add)






